rails8-json-rpc-demo/client_app/app/data_flows/database_to_json_rpc_flow.rb

  def self.setup_flow
    # Create or update the DataFlow record in the database
    ActiveDataFlow::DataFlow.find_or_create(
      name: "database_to_json_rpc",
      source: configure_source,
      sink: configure_sink,
      runtime: configure_runtime
    )
---
INSERT INTO "active_data_flow_data_flows" ("name", "source", "sink", "runtime", "status", "last_run_at", "last_error", "created_at", "updated_at") VALUES ('database_to_json_rpc', '{"class_name":"ActiveDataFlow::Connector::Source::ActiveRecordSource","model_class":"OutgoingRecord","scope":"pending","batch_size":10}', '{"class_name":"ActiveDataFlow::Connector::Sink::JsonRpcSink","url":"http://localhost:8999","batch_size":10,"timeout":30,"retry_attempts":3}', '{"class_name":"ActiveDataFlow::Runtime::Heartbeat","interval":30,"enabled":true}', 'active', NULL, NULL, '2025-12-11 01:24:47.152992', '2025-12-11 01:24:47.152992') RETURNING "id"