rails8-json-rpc-demo/server_app/app/data_flows/json_rpc_to_database_flow.rb

INSERT INTO "active_data_flow_data_flows" ("name", "source", "sink", "runtime", "status", "last_run_at", "last_error", "created_at", "updated_at") VALUES ('json_rpc_to_database', '{"class_name":"ActiveDataFlow::Connector::Source::JsonRpcSource","host":"0.0.0.0","port":8999,"timeout":30,"max_connections":10}', '{"class_name":"ActiveDataFlow::Connector::Sink::ActiveRecordSink","model_class":"ReceivedRecord","batch_size":10}', '{"class_name":"ActiveDataFlow::Runtime::Heartbeat","interval":30,"enabled":true}', 'active', NULL, NULL, '2025-12-11 01:24:37.649203', '2025-12-11 01:24:37.649203') RETURNING "id"
---
  def self.setup_flow
    # Create or update the DataFlow record in the database
    ActiveDataFlow::DataFlow.find_or_create(
      name: "json_rpc_to_database",
      source: configure_source,
      sink: configure_sink,
      runtime: configure_runtime
    )